a, c, d = 9, 6, 4
b = 10
a, c, d = c, d, a

print(b, '-', a, '=', c)  # оператор вычитания
print(b, '+', a, '=', a + b)  # оператор сложения
print(b, '*', a, '=', a * b)  # оператор умножения
print(a, '/', b, '=', b / a)  # оператор деления
print(a, '//', b, '=', b // a)  # оператор плоского деления/оператор деления нацело
print('Остаток от деления', a, 'на', b, '=', b % a)  # оператор остатка от деления

a += 1  # Инкремент (а = а + 1)
b -= 1  # Декремент (b = b - 1)
print(a, b)

print(type(a))

# w = 2 in range(2, 4)
# e = 4 in range(5, 6)
# r = 6 in range(7)
# print(e)
